Tekla Open API Reference for Tekla Structures 2025
BoltGroup.BoltType Property
 The type of the bolt group.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BoltGroup.BoltTypeEnum BoltType { get; set; }
Public Property BoltType As BoltGroup.BoltTypeEnum
	Get
	Set
Property Value
Type: BoltGroup.BoltTypeEnum
See Also
Reference
BoltGroup Class
Tekla.Structures.Model Namespace